Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་གང་ཞེ་ན།
en: (2) “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of meditative absorption?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་གཅིག་སྟེ། གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་སྟེ་འདི་ནི་གཅིག་གོ། །
en: Son of noble family, there is a single bodhisattva ornament of absorption: loving all sentient beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་གཉིས་པོ་འདི་དག་སྟེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲང་བ་དང་། མཉེན་པ་སྟེ་གཉིས་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are two types of bodhisattva ornaments of absorption: honesty and suppleness.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་གསུམ་པོ་འདི་དག་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྒྱུ་མེད་པ་དང་། གཡོ་མེད་པ་དང་། བཅོས་མ་མེད་པ་སྟེ་གསུམ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are three types of bodhisattva ornaments of absorption: lack of deception, cunning, and hypocrisy.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་བཞི་པོ་འདི་དག་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདུན་པས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་། ཞེ་སྡང་གིས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་། གཏི་མུག་གིས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་། འཇིགས་པས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་སྟེ་བཞི་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are four types of bodhisattva ornaments of absorption: not being immobilized by desire, hatred, delusion, and fear.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་ལྔ་པོ་འདི་དག་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྒྲིབ་པ་ལྔ་སྤོང་བ་སྟེ། ལྔ་པོ་དེ་དག་གང་ཞེ་ན། འདོད་པ་ལ་འདུན་པ་དང་། གནོད་སེམས་དང་། རྨུགས་པ་དང་། གཉིད་དང་། རྒོད་པ་དང་། འགྱོད་པ་དང་། ཐེ་ཚོམ་སྟེ།
en: “Son of noble family, there are five types of bodhisattva ornaments of absorption: abandoning the five obstructions of sensual desire, ill will, drowsiness and torpor, agitation and regret, and doubt.

source: སྒྲིབ་པ་ལྔ་པོ་འདི་དག་སྤོང་བའོ། །
en: These five obstructions are abandoned.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་དྲུག་པོ་འདི་དག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་སྟེ་དྲུག་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are six types of bodhisattva ornaments of absorption: recollecting the Buddha, the Dharma, the Saṅgha, generosity, morality, and the gods.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་བདུན་པོ་འདི་དག་སྟེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་བསྒོམ་པ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རབ་ཏུ་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། བདུན་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are seven types of bodhisattva ornaments of absorption: cultivating the seven factors of awakening without forgetting the thought of awakening: correct mindfulness, correct investigation of phenomena, correct vigor, correct joy, correct pliancy, correct absorption, and correct equanimity.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་བརྒྱད་པོ་འདི་དག་སྟེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པ་སྟེ། འདི་ལྟར་ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ་བརྒྱད་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are eight types of bodhisattva ornaments of absorption: cultivating the noble eightfold path, that is to say, correct view, correct intention, correct speech, correct action, correct livelihood, correct effort, correct mindfulness, and correct absorption.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་དགུ་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are nine types of bodhisattva ornaments of absorption:

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བརྗེད་པ་མེད་པའི་སེམས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོའི་གནས་ལ་གནས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་གནས་ནས་འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ་དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who, without being forgetful, dwell on the foundation of great compassion, never abandon any sentient being, and then, detached from desire, sin, and nonvirtues attain to and abide in the first concentration, which has applied and sustained thought and is joyful and blissful through detachment;

source: དེ་རྟོག་པ་དང་། དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who are freed from applied and sustained thought, have inner serenity, and attain to and abide in the second concentration, which is joyful and blissful through absorption that is one-pointed and has no applied or sustained thought;

source: དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ་འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ། བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who are freed from the desire for joy, dwell in equanimity, are mindfully aware, and attain to and abide in the third concentration that is beyond joy, experiencing that physical bliss of which the noble ones say, ‘this is mindful equanimity established in bliss’;

source: དེ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་བ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ། བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who have abandoned bliss, having previously abandoned suffering, whose happiness and sadness have subsided, and who attain to and abide in the fourth concentration, which is pure mindfulness and equanimity that is neither bliss nor suffering;

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས། ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who have transcended the perception of form, whose perception of physical obstruction has subsided, who pay no attention to diverse perceptions but think, ‘space is unending,’ and who attain to and abide in the realm of infinite space;

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who have completely transcended the realm of infinite space and think, ‘consciousness is unending,’ who attain to and abide in the realm of infinite consciousness;

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། ཅིའང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who have completely transcended the realm of infinite consciousness and think, ‘there is nothing at all,’ who attain to and abide in the realm of nothing at all;

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: that of bodhisattvas who have completely transcended the realm of nothing at all and attain to and abide in the Sphere of neither Perception nor Nonperception;

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་ཀྱང་ཐབས་མཁས་པས་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུའང་མི་བྱེད་ལ། སྔོན་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཡང་དག་པར་གནས། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: and that of bodhisattvas who have completely transcended the Sphere of neither Perception nor Nonperception and attain the cessation of sensation and perception, but though they attain it, because of skillful means they refrain from manifesting the limit of reality and instead, due to previous blessing, remain present and mature sentient beings.

source: ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་དགུ་པོ་འདི་དག་གོ། །
en: These are the nine ornaments of absorption.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་བཅུ་པོ་འདི་དག་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་འཁྲུགས་པས་ངེས་པར་སེམས་པ་དང་། ཞི་གནས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། མངོན་པར་བརྩོན་པ་མི་འདོར་བ་དང་། ནང་དུ་ཡང་དག་འཇོག་སྦེད་པ་དང་། དགེ་བའི་རྩ་བ་རྣམས་ཆུད་མི་ཟ་བ་དང་། སེམས་དབེན་པ་དང་། ལུས་ཤིན་ཏུ་སྦྱངས་པ་དང་། ཆོས་རྣམས་ལ་སེམས་ཤིང་འཇལ་ལ་སོ་སོར་རྟོག་པ་དང་། སེམས་ལ་དབང་སྒྱུར་བ་དང་། འཕགས་པའི་རིགས་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: “Son of noble family, there are ten types of bodhisattva ornaments of absorption: gaining certainty through imperturbability, perfecting tranquil abiding, not forsaking diligent effort, withdrawing into meditative seclusion, not squandering the roots of virtue, maintaining mental solitude, maintaining physical pliancy, being discerning while thinking about and evaluating phenomena, controlling the mind, and attaining the noble lineage.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྒྱན་ནི་བཅུ་པོ་འདི་དག་གོ། །
en: Son of noble family, these are the ten types of bodhisattva ornaments of absorption.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་གང་ཞེ་ན།
en: (3) “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of insight?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་གཅིག་སྟེ། གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ལ་ཐེ་ཚོམ་མེད་པ་སྟེ། འདི་ནི་གཅིག་གོ། །
en: Son of noble family, there is a single bodhisattva ornament of insight. It is having no doubts about any phenomenon.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་གཉིས་པོ་འདི་དག་སྟེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འགྱོད་པ་དང་བྲལ་བ་དང་། ཀུན་ནས་ལྡང་བ་དང་བྲལ་བ་སྟེ། གཉིས་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are two types of bodhisattva ornaments of insight: having no regret and not being agitated.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་གསུམ་པོ་འདི་དག་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གཏི་མུག་སྤོང་བ་དང་། མ་རིག་པའི་སྒོ་ངའི་སྦུབས་ངེས་པར་གཅོག་པ་དང་། མུན་པ་མུན་ནག་སེལ་བ་སྟེ། གསུམ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are three types of bodhisattva ornaments of insight: abandoning delusion, breaking through the shell of ignorance, and dispelling the thick darkness of confusion.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་བཞི་པོ་འདི་དག་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་སྤང་བའི་སྣང་བ་དང་། འགོག་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་གསལ་དང་། ལམ་བསྒོམ་པའི་བྱིན་གྱི་རླབས་ཏེ། བཞི་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are four types of bodhisattva ornaments of insight: understanding the suffering that is to be understood, illuminating the source of suffering to be relinquished, bringing to light the cessation to be realized, and being empowered to cultivate the path.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་ལྔ་པོ་འདི་དག་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དམིགས་པ་མེད་པས་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་མཆོག་གིས་བསམ་གཏན་པ་ཡིན་པས་ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ཡོངས་སུ་དག་པ་དང་། གཉིས་དང་བྲལ་བས་རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་ཡོངས་སུ་དག་པ་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་པས་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ཡོངས་སུ་དག་པ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཉིད་པས་ཆོས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་དག་པ་སྟེ། ལྔ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are five types of bodhisattva ornaments of insight: purification of morality through lack of objectification, purification of absorption through concentration endowed with supreme insight, purification of liberation through nonduality, purification of the vision of liberating wisdom through the sameness of the three times, and purification of phenomena by means of the nature of reality free of attachment.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་དྲུག་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are six types of bodhisattva ornaments of insight:

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྒྱུ་མ་དང་མཉམ་པ་ཉིད་པས་བདག་གི་འཁོར་ཡོངས་སུ་དག་པ་དང་། རྨི་ལམ་དང་མཉམ་པ་ཉིད་པས་སེམས་ཅན་གྱི་འཁོར་ཡོངས་སུ་དག་པ་དང་། རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པས་བྱང་ཆུབ་ཀྱི་འཁོར་ཡོངས་སུ་དག་པའོ། །
en: transcendent generosity purified of the three spheres—the sphere of the agent purified because of being the same as an illusion, the sphere of sentient beings purified because of being the same as a dream, and the sphere of awakening purified through not hoping for results;

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གཟུགས་བརྙན་ལྟ་བུའི་ཕྱིར་ལུས་ཀྱི་འཁོར་ཡོངས་སུ་དག་པ་དང་། བྲག་ཅ་ལྟ་བུའི་ཤེས་པས་ངག་གི་འཁོར་ཡོངས་སུ་དག་པ་དང་། སྒྱུ་མ་དང་མཉམ་པ་ཉིད་པས་སེམས་ཀྱི་འཁོར་ཡོངས་སུ་དག་པའོ། །
en: transcendent morality purified of the three spheres—the sphere of body purified on account of being like a reflection, the sphere of speech purified by understanding it to be like an echo, and the sphere of the mind purified because of being the same as an illusion;

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཉེས་པར་སྨྲས་པའི་ཚིག་རྣམས་ལ་ཁོང་ཁྲོ་བ་སྤོང་བ་ཡོངས་སུ་དག་པ་དང་། བསྟོད་པ་དང་། བསྔགས་པ་དང་། རྗེས་སུ་ཆགས་པ་སྤོང་བ་ཡོངས་སུ་དག་པ་དང་། ཡན་ལག་དང་ཉིང་ལག་གཅོད་པ་དག་ལ་ཆོས་ཀྱི་སྐུ་ལ་རབ་ཏུ་རྟོག་པ་ཡོངས་སུ་དག་པའོ། །
en: transcendent patience purified of the three spheres—purification in abandoning aversion toward harshly spoken words, purification in abandoning desire for praise and adulation, and purification of understanding the dharmakāya in the offering of severed limbs and body parts;

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འཁོར་བ་རྨི་ལམ་ལྟ་བུར་མོས་པས་ཡོངས་སུ་མི་སྐྱོ་བ་ཡོངས་སུ་དག་པ་དང་། རྡོ་རྗེ་ལྟ་བུའི་བསམ་པས་བརྟན་པ་ཡོངས་སུ་དག་པ་དང་། མཚན་མ་ཐམས་ཅད་ལས་སྒྲོལ་བས་བླང་བ་མེད་པ་དང་དོར་བ་མེད་པ་ཡོངས་སུ་དག་པའོ། །
en: transcendent vigor purified of the three spheres— purification in not being disheartened through the conviction that saṃsāra is dreamlike, purification in being stable through a vajra-like intention, and purification in neither accepting nor rejecting through liberating oneself from all conceptual signs;

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འགྱུར་བར་ཤེས་པས་དེ་ལ་མ་ཆགས་པ་ཡོངས་སུ་དག་པ་དང་། མངོན་པར་ཞེན་པ་མེད་པས་ལྷག་མཐོང་ཡོངས་སུ་དག་པ་དང་། མངོན་པར་ཤེས་པ་སྐྱེད་པས་དམིགས་པ་ཡོངས་སུ་དག་པའོ། །
en: transcendent concentration purified of the three spheres—purification in nonattachment to it through understanding its mutability, purification in special insight through lack of obsession, and purification in focus through generation of superknowledge;

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་བསྡུ་བའི་དངོས་པོ་ཡོངས་སུ་དག་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པས་གཟུངས་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་གྱི་ཕྱིར་སྨོན་ལམ་ཡོངས་སུ་དག་པ་སྟེ། དྲུག་པོ་འདི་དག་གོ། །
en: and transcendent skillful means purified of the three spheres—purification in matters relating to gathering disciples by bringing beings to maturity, purification in having retention through upholding the true Dharma, and purification in aspirations in order to ornament the buddhafields.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་བདུན་པོ་འདི་དག་སྟེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་ལ་སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པར་ཤེས་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ཀྱིས་ལུས་དང་སེམས་དབེན་པ་དང་། དབང་པོ་རྣམས་ལ་དབང་པོ་ཡོངས་སུ་ཤེས་པ་དང་། སྟོབས་རྣམས་ཀྱིས་བདུད་དང་ཉོན་མོངས་པ་ཐམས་ཅད་ཚར་གཅོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དང་། ལམ་རྣམས་ལ་འོང་བ་མེད་པ་དང་འགྲོ་བ་མེད་པར་ཤེས་པ་སྟེ་བདུན་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are seven types of bodhisattva ornaments of insight: being without mindfulness or mental engagement among the applications of mindfulness, understanding the lack of arising and cessation among correct exertions, being physically and mentally detached through the bases of miraculous powers, understanding the spiritual faculties among the sense faculties, annihilating all māras and afflictive emotions by means of the strengths, understanding by means of the factors of awakening the nature of all phenomena, and understanding that there is no coming and going among the paths.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་བརྒྱད་པོ་འདི་དག་སྟེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཤིན་ཏུ་ཞི་བའི་ཕྱིར་ཞི་གནས་ཤེས་པ་དང་། རབ་རིབ་དང་བྲལ་བའི་ཕྱིར་ལྷག་མཐོང་ཤེས་པ་དང་། ཆོས་ཀྱི་ཕུང་པོ་རྗེས་སུ་རྟོགས་པའི་ཕྱིར་ཕུང་པོ་ཤེས་པ་དང་། ནམ་མཁའི་ཁམས་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་ཁམས་ཤེས་པ་དང་། གྲོང་སྟོང་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་སྐྱེ་མཆེད་ཤེས་པ་དང་། བདག་མེད་པའི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤེས་པ་དང་། མི་འཁྲུགས་པའི་ཕྱིར་བདེན་པ་ཤེས་པ་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་རྟོགས་པས་ཆོས་ཐམས་ཅད་ངེས་པར་རྟོགས་པ་ཤེས་པ་སྟེ། བརྒྱད་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are eight types of bodhisattva ornaments of insight: understanding tranquil abiding on account of having deep serenity, understanding special insight on account of lacking distorted vision, understanding the aggregates on account of realizing the collections of Dharma, understanding the elements because they are the same as the element of space, understanding the sense fields because they are the same as a ghost town, understanding dependent arising because it is without self, understanding the truths on account of a lack of turmoil, and understanding the definite realization of all phenomena on account of the full realization of reality just as it is.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་དགུ་པོ་འདི་དག་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྔོན་གྱི་མཐའ་དག་པས་འདས་པ་ཤེས་པ་དང་ཕྱི་མའི་མཐའ་དག་པས་མ་འོངས་པ་ཤེས་པ་དང་། བར་གྱི་མཐའ་དག་པས་ད་ལྟར་བྱུང་བ་ཤེས་པ་དང་། རྒྱུ་ཆུད་མི་ཟ་བས་ངེས་པ་རྣམས་ཤེས་པ་དང་། རྐྱེན་ཕྱེ་བར་སྒྲུབ་པས་མ་ངེས་པ་རྣམས་ཤེས་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱེད་པས་ལོག་པ་ཉིད་དུ་མ་ངེས་པ་རྣམས་ཤེས་པ་དང་། ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བའི་ཕྱིར་སངས་རྒྱས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཀྱི་ཕྱིར་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་། འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའི་ཕྱིར་འཕགས་པ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་སྟེ། དགུ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are nine types of bodhisattva ornaments of insight: understanding the past by means of the beginning, understanding the future by means of the end, understanding the present by means of the intervening, understanding the determinate destinies given that causes do not perish, understanding the indeterminate destinies given that conditions may produce different results, understanding the destinies of those who because of spiritual maturation are not predisposed to erring, understanding that all buddhas are equal because they are distinguished by the dharmakāya, understanding all phenomena to be sameness since reality is free of attachment, and understanding all noble ones to be equal because they are distinguished by the unconditioned.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་རྒྱན་ནི་བཅུ་པོ་འདི་དག་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རྣམ་པར་བསྒྲུབ་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་སྒྱུ་མ་ལྟ་བུར་ཤེས་པ་དང་། ཡོངས་སུ་རྟོག་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་རྨི་ལམ་ལྟ་བུར་ཤེས་པ་དང་། རྣམ་པར་འཁྲུལ་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་སྨིག་རྒྱུ་ལྟ་བུར་ཤེས་པ་དང་། འཕོ་བ་མེད་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་པ་དང་། འདུ་འཕྲོད་ཀྱི་མཚན་ཉིད་ཀྱི་ཕྱིར་མིག་ཡོར་ལྟ་བུར་ཤེས་པ་དང་། རྐྱེན་གྱི་མཚན་ཉིད་ཀྱི་ཕྱིར་བྲག་ཅ་ལྟ་བུར་ཤེས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པའི་མཚན་ཉིད་དུ་ཤེས་པ་དང་། དེ་བཞིན་ཉིད་གནས་མེད་པའི་མཚན་ཉིད་དུ་ཤེས་པ་དང་། ཡང་དག་པའི་མཐའ་མི་འཁྲུགས་པའི་མཚན་ཉིད་དུ་ཤེས་པ་དང་། འདུས་བྱས་དག་འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་དུ་ཤེས་པ་སྟེ།
en: “Son of noble family, there are ten types of bodhisattva ornaments of insight: understanding the nature of reality to be illusory on account of the characteristic of accomplishment, understanding it to be like a dream on account of the characteristic of conceptuality, understanding it to be like a mirage on account of the characteristic of deception, understanding it to be like a reflection on account of the characteristic of motionlessness, understanding it to be like a hallucination on account of the characteristic of being an assembly, understanding it to be like an echo on account of the characteristic of being conditioned, understanding the realm of phenomena as characterized by being uncorrupted, understanding thusness as characterized by being nonabiding, understanding the limit of reality as characterized by being unperturbed, and understanding the conditioned as being characterized by being unconditioned.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་གང་ཞེ་ན།
en: (4) “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of retention?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་གཅིག་སྟེ་གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་བརྗེད་པ་མེད་པ་སྟེ། འདི་ནི་གཅིག་གོ། །
en: Son of noble family, there is a single bodhisattva ornament of retention. It is remembering without forgetting.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་གཉིས་པོ་འདི་དག་སྟེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཀུན་ཏུ་འཛིན་པ་དང་། འཛིན་པ་སྟེ། གཉིས་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are two types of bodhisattva ornaments of retention: full retention and retention.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་གསུམ་པོ་འདི་དག་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དོན་ལ་མཁས་པ་དང་། ཚིག་འབྲུ་ལ་མཁས་པ་དང་། ངེས་པའི་ཚིག་ལ་མཁས་པ་སྟེ། གསུམ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are three types of bodhisattva ornaments of retention: skill in meaning, phonemes, and etymology.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་བཞི་པོ་འདི་དག་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆགས་པ་མེད་པའི་ཚིག་དང་། རྩུབ་པ་མ་ཡིན་པའི་ཚིག་དང་། རབ་ཏུ་གྲོལ་བའི་ཚིག་དང་། བརྫུན་པ་མེད་པའི་ཚིག་སྟེ། བཞི་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are four types of bodhisattva ornaments of retention: speaking words that are dispassionate, refined, liberated, and without falsehood.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་རྒྱན་ནི་ལྔ་པོ་འདི་དག་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཐོས་པ་ཐམས་ཅད་ཀྱི་ནང་ནས་དོན་ལ་རྟོན་པ་དང་། ཡི་གེའི་ཚོགས་ཐམས་ཅད་ཀྱི་ནང་ནས་ཡེ་ཤེས་ལ་རྟོན་པ་དང་། མདོ་སྡེ་ཐམས་ཅད་ཀྱི་ནང་ནས་ངེས་པའི་དོན་གྱི་མདོ་སྡེ་ལ་རྟོན་པ་དང་། གང་ཟག་གི་སྒྲ་ཐམས་ཅད་ལས་ཆོས་ཉིད་ལ་རྟོན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་འཇིག་རྟེན་ལས་འདས་པ་ལ་རྟོན་པ་སྟེ། ལྔ་པོ་འདི་དག་གོ། །
en: “Son of noble family, there are five types of bodhisattva ornaments of retention: reliance on meaning among all one has studied, reliance on wisdom among all collections of words, reliance on sūtras of definitive meaning among all the sūtras, reliance on the nature of reality rather than all the words of persons, and reliance on the supramundane rather than on all that is mundane.
